<a href="https://colab.research.google.com/github/audrey-siqueira/Desafio_Keycash/blob/main/Desafio1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Importando Bilbiotecas

Vamos utilizar o SQLITE para trabalhar no ambiente do Colab

In [ ]:
import pandas as pd
import sqlite3

## Carregando banco de dados dos Imóveis

Os dados dos imóveis são carregados através do comando abaixo.

In [ ]:
conn = sqlite3.connect('exemplo_vazio.db')
df = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/Keycash/Desafio1_imoveis.csv',sep = ';')
df.to_sql('tabela_imoveis',conn,if_exists='replace',index=False)
df

    ID_IMOVEL  ID_BAIRRO  AREA_m2    PRECO
0           1          1      126   827600
1           2          2      129  1111246
2           3          3       92   762763
3           4          1       96   748262
4           5          2      116   841057
5           6          3       99   658592
6           7          3      104  1022486
7           8          3      141   950101
8           9          2      101  1159807
9          10          1      140  1176378
10         11          1      121   861442
11         12          1      142  1134910
12         13          3       61  1000850
13         14          1       66   762721
14         15          1       90  1187119
15         16          2      119  1062869
16         17          2      100   902953
17         18          2      101   971834
18         19          3      110   875982
19         20          2      143   718857

## Comando de SQL 1

Abaixo o comando SQL para buscar a Query desejada.

In [ ]:
sql='''select ID_BAIRRO,  ROUND(AVG(PRECO/AREA_m2),2) 
       from tabela_imoveis
       where ID_BAIRRO='1' OR ID_BAIRRO='3' 
       GROUP by ID_BAIRRO
       order by AVG(PRECO/AREA_m2) desc'''

## Tabela Intermediária

No comando abaixo foi calculado o Preço médio do metro quadrado para os bairros 1 e 3.

In [ ]:
conn2 = sqlite3.connect('exemplo2_vazio.db')
df2=pd.read_sql(sql,conn)
df2.rename(columns = {'ROUND(AVG(PRECO/AREA_m2),2)':'Preço_Médio_do_m2'}, inplace = True)
df2.to_sql('valor_medio',conn2,if_exists='replace',index=False)
df2

   ID_BAIRRO  Preço_Médio_do_m2
0          3            9313.50
1          1            8945.86

## Carregando banco de dados dos Bairros

In [ ]:
df3 = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/Keycash/Desafio1_nome_bairros.csv',sep = ';')
df3.to_sql('tabela_bairros',conn2,if_exists='replace',index=False)
df3

   ID_BAIRRO    NOME_BAIRRO ATUACAO
0          1     Itaim Bibi       S
1          2   Vila Olimpia       N
2          3      Pinheiros       S
3          4  Vila Madalena       N
4          5   Vila Mariana       N

## Comando de SQL 2

Abaixo o comando SQL para buscar a Query desejada anexando a tabela de Bairros a tabela de Imóveis.

In [ ]:
sql2='''SELECT tabela_bairros.NOME_BAIRRO,valor_medio.Preço_Médio_do_m2
        FROM tabela_bairros
        INNER JOIN valor_medio ON tabela_bairros.ID_BAIRRO = valor_medio.ID_BAIRRO
        order by Preço_Médio_do_m2 desc'''

## Tabela Final

O resultado final é obtido, sabendo o Preço médio do metro quadrado dos imóveis dos bairros 1 e 3, que através da tabela de Bairros, nos informou serem os bairros Itaim Bibi e Pinheiros. Os resultados foram apresentados de forma descrescente em relação aos preços.

In [ ]:
conn3 = sqlite3.connect('exemplo3_vazio.db')
df4=pd.read_sql(sql2,conn2)
df4.to_sql('tabela_final',conn3,if_exists='replace',index=False)
df4

  NOME_BAIRRO  Preço_Médio_do_m2
0   Pinheiros            9313.50
1  Itaim Bibi            8945.86